{
    "nav.home": "Home",
    "nav.about-me": "About me",
    "nav.skill": "Skill",
    "nav.experience": "Experience",
    "nav.project": "Projects",
    "nav.contact":"Contact",

    "home.cv": "English",
    "home.cv.link": "En_Dylan_Espana_Cervantes.pdf",


    "about-me.title": "About Me",
    "about-me.paragraph1": "Hello! I'm Dylan Spain 🙋‍♂️ and I have +1 experience as a Full Stack Developer. Developed web applications using technologies such as PHP, MySQL, NextJS, React, among others. My development approach is based on creating a clean and scalable code structure 🚀, which makes it easier to solve future problems and helps to optimize the application.",
    "about-me.paragraph2": "Despite the time I have in software development, my goal has always been to become a technical leader in my field 💼. I understand that to reach that level it is necessary to continue learning and growing in my career 🧠. In the short term, my goal is to surround myself with experienced professionals 💪 and learn from them to develop the skills and knowledge necessary to achieve my long-term goal.",
    "about-me.paragraph3": "I strive to find opportunities to work on teams with leaders in my field 💻 and make the most of each opportunity to learn from their experience and knowledge 📚. Despite my short experience, I am sure that this philosophy will help me develop the skills and knowledge necessary to achieve my long-term goal of becoming a technical leader 🚀.",
    "about-me.paragraph4": "I love understanding user needs and providing solutions that fit them. Working in a team is something that I really enjoy and I believe that effective communication and empathy are essential to achieve a good result.",
    "about-me.paragraph5": "In addition to my programming experience, I also have knowledge in marketing 💁‍♂️, finance and investments.",
    "about-me.paragraph6": "I consider myself a highly self-taught person 🙌, since I always take advantage of and look for opportunities to learn, improve my skills and knowledge in software development and in turn acquire business knowledge to continue growing professionally 🧠.",
    "about-me.paragraph7": "I love adding value to companies, and I'm sure my experience and passion for development will be of great benefit to any team I work on. Don't wait any longer and hire me! I'm sure you won't regret your decision.",
    "about-me.paragraph8": "I wish you and the team a great week 😀.",



    "skill.title-general": "Skills",
    "skill.other-title": "Others",
    "skill.other-tools": "Tools",



    "experience.title-general": "Professional Experience",
    "experience.position-title": "Position Held: ",
    "experience.activities-title": "Performed Activities",
    "experience.technologies-title": "Technologies",

    "experience.dueño-pine": "Own Company",
    "experience.position-pine": "Full Stack",
    "experience.activities-pine1": "Organization of platform development.",
    "experience.activities-pine2": "Management of the developer team.",
    "experience.activities-pine3": "Development of the MVP frontend with ReactJS.",
    "experience.activities-pine4": "MVP backend development with NextJS (NodeJS).",
    "experience.activities-pine5": "Propose improvements for the interface and user experience.",

    "experience.position-gesprender": "Full Stack",
    "experience.activities-gesprender1": "I contributed in the design and layout of the user interface using tools such as HTML5, CSS3, Bootstrap, and React.",
    "experience.activities-gesprender2": "I implemented and corrected modules and elements on the platform using PHP, MySQL, JavaScript, and JQuery.",
    "experience.activities-gesprender3": "I redesigned and optimized existing components to improve the user experience.",
    "experience.activities-gesprender4": "I created specific scripts to automate tasks such as mass messaging and fake data generation using PHP and Python.",
    "experience.activities-gesprender5": "I developed and consumed APIs using PHP and Symfony, as well as corrected and maintained existing ones.",
    "experience.activities-gesprender6": "I managed and maintained the database using MySQL and Postman.",
    "experience.activities-gesprender7": "I implemented features and corrected bugs on the platform using React and PHP.",
    "experience.activities-gesprender8": "I participated in the development of new features and improvements in the system.",

    "experience.position-id-for-idea": "Backend con PHP",
    "experience.activities-id-for-idea1": "Developed the logic of elements and features on the platform using PHP.",
    "experience.activities-id-for-idea2": "Implemented connections to the database.",
    "experience.activities-id-for-idea3": "Performed maintenance tasks on the database, including optimization of queries and problem resolution.",



    "project.title-general": "MY Projects",
    "project.description-general": "These are some of my projects, but I'm sure when I'm checking this out, I might be working on others.",

    "project.title-DataFMovies": "Data FMovies",
    "project.description-DataFMovies": "Data FMovies is a web application that will keep you up-to-date with the latest releases of your favorite movies and TV shows, as well as the most prominent actors and actresses in the film industry. With this application, you'll always be informed of the latest trends and won't miss any of your favorite productions. Don't miss the opportunity to be at the forefront of the world of cinema and television!.",

    "project.title-Finterest": "Finterest",
    "project.description-Finterest": "Finterest is a small copy of the great page Pinterest.",

    "project.title-Web-3D": "Web 3D",
    "project.description-Web-3D": "Landing page for beta of a platform that provides unique tools to team members.",

    "project.title-cutly": "Cutly",
    "project.description-cutly": "This work was created thinking that many link cutters carry advertising and put the computer security of the people who press the link at risk, this shortener has no advertising and is completely free.",

    "project.title-WeatherApp": "Weather APP",
    "project.description-WeatherApp": "A meteorological application where it shows the weather days in advance using the longitude and latitude coordinates of the required place, also depending on the weather the background image of the web changes to provide the user with greater immersion.",

    "project.title-gowner-music": "GownerMusic",
    "project.description-gowner-music": "Gowner Music is the best social network oriented to the musical world, here you can get in touch with people who have your same artistic passion and also have the opportunity to connect with different world-class record labels that are looking for hidden talent. ------ They could change your life!!! ------ NOTE: This project is still in progress, but you can see how it is progressing (username: admin ---- password: admin).",

    "project.title-NewTech": "NewTech",
    "project.description-NewTech": "New Tech is a news portal where you can find out what is happening in different corners of the world.",

    "project.title-APINewTech": "API NewTech",
    "project.description-APINewTech": "It is a modification of the NEWS API, since the NEWS API api could not be used in production, so some changes were made to the endpoints and a new api was created using the one provided by NEWS API as a sub-api, in this way In this way, the API could be used in production without any inconvenience. If you want to use it for another user, you will have to modify the value of the API KEY in the main code.",

    "project.title-GDrive": "Herramientas para G-Drive",
    "project.description-GDrive": "It is a Google Colab that creates using different python and third-party libraries to work with files within Google Drive, such as decompressing files, copying files from different drives, among other features, in this way we will avoid downloading files that are too large and We will be able to manage them at ease from the same cloud.",

        "project.title-test-laravel": "P-A-Laravel",
        "project.description-test-laravel": "Un proyecto simple, donde se puede tener ordenado a las lsitas de compañias y a sus empleados.",

        "project.title-concesionario": "Concesionario de Autos",
        "project.description-concesionario": "Una Web Pages para poder ver el catalogo de autos de un Concesionario de diversas clases de vehiculos, tanto deportivos como clasicos.",
        
        "project.title-CRUD": "CRUD con PHP",
        "project.description-CRUD": "A modelo de practicar me hice un CRUD para gestionar una lista de personas.",



    "contact.title-general": "Hire Me",
    "contact.description-general": "You can send me a message, either to commission a project, to hire me, suggest an improvement or even say hello. 😀",
    "contact.type.address": "Address",
    "contact.button": "Send",

    "contact.send-Response": "<input type='hidden' name='_autoresponse' value='Hola, muchas gracias por ponerte en contacto conmigo, dentro de poco estare contestando tu E-mail, que tengas un lindo dia.'>",
    


    "footer.home": "Home",
    "footer.about-me": "About me",
    "footer.skill": "Skill",
    "footer.experience": "Experience",
    "footer.project": "Project",
    "footer.contact": "Contact"
}