{
    "nav.home": "Home",
    "nav.about-me": "Sobre mi",
    "nav.skill": "Habilidades",
    "nav.experience": "Experiencia",
    "nav.project": "Proyectos",
    "nav.contact":"Contacto",

    "home.cv": "Español",
    "home.cv.link": "En_Dylan_Espana_Cervantes.pdf",


    "text": "A pesar de solo tener +1 años de experiencia en el desarrollo de software, mi objetivo siempre ha sido convertirme en un líder técnico en mi campo 💼. Entiendo que para llegar a ese nivel es necesario seguir aprendiendo y creciendo en mi carrera 🧠. En mi corto plazo, mi objetivo es rodearme de profesionales experimentados 💪 y aprender de ellos para desarrollar las habilidades y conocimientos necesarios para alcanzar mi meta a largo plazo. Me esfuerzo por buscar oportunidades de trabajar en equipos con líderes en mi campo 💻 y aprovechar al máximo cada oportunidad para aprender de su experiencia y conocimiento 📚. A pesar de mi corta experiencia, estoy seguro de que esta filosofía me ayudará a desarrollar las habilidades y conocimientos necesarios para alcanzar mi objetivo a largo plazo de convertirme en un líder técnico 🚀",

    "about-me.title": "Sobre Mi",
    "about-me.paragraph1": "¡Hola! Soy Dylan España 🙋‍♂️ y cuento con +1 de experiencia como Desarrollador Full Stack. He desarrollado aplicaciones web utilizando tecnologías como PHP, MySQL, NextJS, React, entre otras. Mi enfoque en el desarrollo se basa en crear una estructura de código limpia y escalable 🚀, lo que facilita la resolución de problemas futuros y ayuda a optimizar la aplicación.",
    "about-me.paragraph2": "A pesar del tiempo que tengo en el desarrollo de software, mi objetivo siempre ha sido convertirme en un líder técnico en mi campo 💼. Entiendo que para llegar a ese nivel es necesario seguir aprendiendo y creciendo en mi carrera 🧠. En mi corto plazo, mi objetivo es rodearme de profesionales experimentados 💪 y aprender de ellos para desarrollar las habilidades y conocimientos necesarios para alcanzar mi meta a largo plazo.",
    "about-me.paragraph3": "Me esfuerzo por buscar oportunidades de trabajar en equipos con líderes en mi campo 💻 y aprovechar al máximo cada oportunidad para aprender de su experiencia y conocimiento 📚. A pesar de mi corta experiencia, estoy seguro de que esta filosofía me ayudará a desarrollar las habilidades y conocimientos necesarios para alcanzar mi objetivo a largo plazo de convertirme en un líder técnico 🚀.",
    "about-me.paragraph4": "Me encanta entender las necesidades del usuario y proporcionar soluciones que se ajusten a ellas. Trabajar en equipo es algo que disfruto mucho y creo que la comunicación eficaz y la empatía son fundamentales para lograr un buen resultado.",
    "about-me.paragraph5": "Además de mi experiencia en programación, también tengo conocimientos en marketing 💁‍♂️, finanzas e inversiones.",
    "about-me.paragraph6": "Me considero una persona altamente autodidacta 🙌, ya que siempre aprovecho y busco oportunidades de aprender, mejorar mis habilidades y conocimientos en el desarrollo de software y a su vez adquirir conocimientos empresariales para continuar creciendo profesionalmente 🧠.",
    "about-me.paragraph7": "Me encanta aportar valor a las empresas, y estoy seguro de que mi experiencia y pasión por el desarrollo serán un gran beneficio para cualquier equipo en el que trabaje. ¡No esperes más y contrátame! Estoy seguro de que no te arrepentirás de tu decisión.",
    "about-me.paragraph8": "Les deseo a ti y al equipo una excelente semana 😀.",



    "skill.title-general": "Habilidades",
    "skill.other-title": "Otras",
    "skill.other-tools": "Herramientas",



    "experience.title-general": "Experiencia Profesional",
    "experience.position-title": "Cargo: ",
    "experience.activities-title": "Actividades Desempeñadas",
    "experience.technologies-title": "Tecnologías",


    "experience.dueño-pine": "Compañia Propia",
    "experience.position-pine": "Full Stack",
    "experience.activities-pine1": "Organización del desarrollo de la plataforma.",
    "experience.activities-pine2": "Manejo del equipo de desarrolladores.",
    "experience.activities-pine3": "Desarrollo del frontend del MVP con ReactJS.",
    "experience.activities-pine4": "Desarrollo del backend del MVP con NextJS (NodeJS).",
    "experience.activities-pine5": "Proponer mejoras para la interfaz y experiencia del usuario.",

    "experience.position-gesprender": "Full Stack",
    "experience.activities-gesprender1": "Contribuí en el diseño y maquetación de la interfaz de usuario utilizando herramientas como HTML5, CSS3, Bootstrap y React.",
    "experience.activities-gesprender2": "Implementé y corregí módulos y elementos en la plataforma utilizando PHP, MySQL, JavaScript y JQuery.",
    "experience.activities-gesprender3": "Rediseñé y optimicé los componentes existentes para mejorar la experiencia del usuario.",
    "experience.activities-gesprender4": "Creé scripts específicos para automatizar tareas como el envío masivo de mensajes y la generación datos falsos utilizando PHP y Python.",
    "experience.activities-gesprender5": "Desarrollé y consumí APIs utilizando PHP y Symfony, así como corregí y mantuve las existentes.",
    "experience.activities-gesprender6": "Administré y mantuve la base de datos utilizando MySQL y Postman.",
    "experience.activities-gesprender7": "Implementé características y corregí bugs en la plataforma utilizando React y PHP.",
    "experience.activities-gesprender8": "Participé en el desarrollo de nuevas funcionalidades y mejoras en el sistema.",

    "experience.position-id-for-idea": "Backend con PHP",
    "experience.activities-id-for-idea1": "Desarrollé la lógica de elementos y características en la plataforma utilizando PHP.",
    "experience.activities-id-for-idea2": "Implementé conexiones a la base de datos.",
    "experience.activities-id-for-idea3": "Realicé tareas de mantenimiento en la base de datos, incluyendo la optimización de consultas y resolución de problemas.",



    "project.title-general": "Mis Proyectos",
    "project.description-general": "Estos son algunos de mis proyectos, pero estoy seguro de que cuando esté checando esto, podría estar trabajando en otros.",

    "project.title-Finterest": "Finterest",
    "project.description-Finterest": "Finterest es una pequeña copia de la gran pagina Pinterest, se realizo con el plan de demostrar los conocimientos en ciertas herramientas",

    "project.title-Web-3D": "Web 3D",
    "project.description-Web-3D": "Landing page para beta de una plataforma que brinda herramientas unicas a personal que trabaja en equipo.",

    "project.title-cutly": "Cutly",
    "project.description-cutly": "Este trabajo se creo pensando en que muchos a cortadores de links llevan consigo publicidad y pone en riesgo la seguridad informatica de las personas que presionan el link,  este acortador no tiene publicidad y es completamente gratuito.",

    "project.title-WeatherApp": "Weather APP",
    "project.description-WeatherApp": "Una aplicación metereológica donde muestra el clima con días de antelación utilizando las coordenadas de longitud y latitud del lugar requerido, también dependiendo del clima la imagen del fondo de la web cambia brindar al usuario una mayor inmersión.",

    "project.title-gowner-music": "GownerMusic",
    "project.description-gowner-music": "Gowner Music es la mejor red social orientada al mundo musical, aquí puedes ponerte en contacto con personas que tienen tu misma pasión artística y además tienes la oportunidad de conectarte con diferentes sellos discográficos de talla mundial que buscan talento oculto. ------ Podrían cambiar tu vida!!! ------ NOTA: Este proyecto aún está en progreso, pero puede ver cómo avanza (nombre de usuario: admin ---- contraseña: admin).",

    "project.title-NewTech": "NewTech",
    "project.description-NewTech": "New Tech es un portal de las noticias donde puedes enterarte de lo que esta sucediendo en los diferentes rincones del mundo.",

    "project.title-APINewTech": "API NewTech",
    "project.description-APINewTech": "Es una modificación de la NEWS API, ya que no se podia usar en produccion la api de NEWS API por lo que se realizo unos cambios en los endpoints y se creo una nueva api utilizando como sub-api la que brinda NEWS API, de esta manera se pudo usar la api en produccion sin ningun inconveniente, si se quiere utilizar para otro usuario se tendra que modificar el valor de la API KEY en el codigo principal.",

    "project.title-GDrive": "Herramientas para G-Drive",
    "project.description-GDrive": "Es un Google Colab que cree utilizando diferentes librarias de python y de terceros, para trabajar con archivos dentro de Google Drive, como descomprimir archivos, copiar archvios de diferentes unidades, entre otras funcionalidades, de esta forma evitaremos descargar los archivos que son demasiados pesados y podremos monejarlos a gusto desde las misma nube.",

        "project.title-test-laravel": "P-A-Laravel",
        "project.description-test-laravel": "Un proyecto simple, donde se puede tener ordenado a las lsitas de compañias y a sus empleados.",

        "project.title-concesionario": "Concesionario de Autos",
        "project.description-concesionario": "Una Web Pages para poder ver el catalogo de autos de un Concesionario de diversas clases de vehiculos, tanto deportivos como clasicos.",
        
        "project.title-CRUD": "CRUD con PHP",
        "project.description-CRUD": "A modelo de practicar me hice un CRUD para gestionar una lista de personas.",


    
    "contact.title-general": "Contratame",
    "contact.description-general": "Puedes enviarme un mensaje, ya sea para encargar un proyecto, para contratarme, sugerir alguna mejora o incluso saludarme. 😀",
    "contact.type.address": "Locación",
    "contact.button": "Enviar",

    "contact.send-Response": "<input type='hidden' name='_autoresponse' value='Hola, muchas gracias por ponerte en contacto conmigo, dentro de poco estare contestando tu E-mail, que tengas un lindo dia.'>",



    "footer.home": "Home",
    "footer.about-me": "Sobre mi",
    "footer.skill": "Habilidades",
    "footer.experience": "Experiencia",
    "footer.project": "Proyectos",
    "footer.contact": "Contacto"
    
}